ERP.belugaerp/src/InformationRegisters/бг_КомментарииПоПунктамНазначения/бг_КомментарииПоПунктамНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_КомментарииПоПунктамНазначения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>EnumRef.бг_ИсточникиКомментариев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_КомментарииПоПунктамНазначения/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Записывает новый комментарий в регистр сведений
//
// Параметры:
//   ПунктНазначения - ПунктНазначения
//   Источник - Значение перечисления бг_ИсточникиКомментариев
//   Комментарий - Комментарий
//   
Процедура ДобавитьКомментарий(ПунктНазначения, Источник, Комментарий) Экспорт

	МенеджерЗаписи = РегистрыСведений.бг_КомментарииПоПунктамНазначения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.ПунктНазначения = ПунктНазначения;
	МенеджерЗаписи.Источник = Источник;
	МенеджерЗаписи.Автор = Пользователи.ТекущийПользователь();
	
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать(Ложь);

КонецПроцедуры

#КонецОбласти
